# Useful Apps
cask "visual-studio-code"
cask "iterm2"
cask "mono-mdk"
cask "powershell"

# General / Utility
brew "coreutils" # Use GNU coreutils instead of BSD utils
brew "git" # Use standard git, not Apple git
brew "trash"
brew "thefuck"
brew "jq"
brew "grep"
brew "gawk"
brew "dos2unix"

# Developer Tools
brew "nvm"
brew "go"
brew "mysql-client"
brew "pre-commit"
brew "go-task/tap/go-task"

# Ops Tools
brew "ansible"
brew "awscli"
brew "saml2aws"

# Terraform
brew "terraform", link: false # Unlinked so it doesn't conflict with tfenv
brew "tfenv"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "terragrunt"

# k8s
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "kubectx"

# Fun
brew "archey"
brew "cowsay"
brew "fortune"
