# Useful Apps
cask "visual-studio-code"
cask "iterm2"
cask "mono-mdk"
cask "powershell"

# General / Utility
brew "bash" # Upgrade bash
brew "coreutils" # Use GNU coreutils instead of BSD utils
brew "git" # Use standard git, not Apple git
brew "bash-completion@2"
brew "trash"
brew "thefuck"
brew "jq"
brew "gron"
brew "grep"
brew "gawk"
brew "gnu-sed"
brew "dos2unix"

# Developer Tools
brew "nvm"
brew "go"
brew "mysql-client"
brew "pre-commit"
brew "go-task" # Taskfile.dev
brew "gh" # GitHub CLI

# Ops Tools
brew "ansible"
brew "awscli"
brew "saml2aws"

# AWS
tap "tedsmitt/ecsgo"
brew "ecsgo" # https://github.com/tedsmitt/ecsgo

# Terraform
brew "tenv"
brew "terraform-docs"
brew "tflint"
brew "tfsec"

# k8s
# Current out of date, so not using these
# tap "little-angry-clouds/homebrew-my-brews"
# brew "kbenv" # kubectl
# brew "helmenv" # helm
brew "kubectl"
brew "helm"

brew "k9s"
brew "danielfoehrkn/switch/switch" # Kubectx alternative

# Fun
brew "archey4"
brew "cowsay"
brew "fortune"
brew "sl"

tap "abyss/tools"
brew "awsp"
brew "tfws"
