# Utility Applications
cask "visual-studio-code"    # Visual Studio Code Editor
cask "iterm2"                # Terminal emulator
cask "alt-tab"               # Windows-style alt-tab switcher
cask "mono-mdk"              # .NET framework
cask "powershell"            # PowerShell for macOS

# GenAI Tooling
cask "claude-code"    # Claude Code
cask "codex"          # OpenAI Codex
cask "copilot-cli"    # GitHub Copilot for CLI
cask "kiro-cli"       # AWS Kiro CLI

# Shell & Terminal Utilities
brew "bash"                 # Upgrade bash from macOS default
brew "bash-completion@2"    # Bash completion for better tab completion
brew "direnv"               # Load/unload environment variables based on pwd
brew "thefuck"              # Correct previous console command
brew "tldr"                 # Simplified man pages
brew "trash"                # Move files to trash instead of rm
brew "watch"                # Execute command periodically watching for changes

# File & Text Processing
brew "coreutils"    # GNU coreutils (better than BSD defaults)
brew "bat"          # Better cat with syntax highlighting
brew "grep"         # GNU grep
brew "gawk"         # GNU awk
brew "gnu-sed"      # GNU sed
brew "dos2unix"     # Convert line endings
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "gron"         # Make JSON greppable
brew "fzf"          # Fuzzy finder for command line

# Version Control & Development Tools
brew "git"           # Use standard git, not Apple git
brew "gh"            # GitHub CLI
brew "pre-commit"    # Git pre-commit hook framework

# Programming Languages & Runtimes
brew "go"     # Go programming language
brew "nvm"    # Node version manager
brew "uv"     # Fast Python package installer

# Build & Release Tools
brew "go-task"        # Task runner (Taskfile.dev)
brew "goreleaser"     # Release automation for Go projects
brew "hugo"           # Static site generator
brew "imagemagick"    # Image manipulation library

# Database & Data Tools
brew "mysql-client"    # MySQL client libraries

# Cloud & Infrastructure - AWS
brew "awscli"                   # AWS command line interface
brew "aws-iam-authenticator"    # AWS IAM authenticator for Kubernetes
brew "aws-sam-cli"              # AWS Serverless Application Model CLI
brew "eksctl"                   # EKS cluster management tool

tap "tedsmitt/ecsgo"
brew "ecsgo"    #  Connect to ECS using the ExecuteCommand API

tap "abyss/tools"
brew "awsp"    # AWS profile switcher
brew "tfws"    # Terraform workspace switcher

# Cloud & Infrastructure - Kubernetes
brew "kubectl"    # Kubernetes command-line tool
brew "helm"       # Kubernetes package manager
brew "k9s"        # Kubernetes TUI

tap "danielfoehrkn/switch"
brew "switch"    # Kubernetes context switcher (kubectx alternative)

# Infrastructure as Code - OpenTofu & Terraform
brew "tenv"              # OpenTofu/Terraform/Terragrunt version manager
brew "terraform-docs"    # Generate Terraform documentation
brew "tflint"            # Terraform linter

tap "minamijoyo/tfupdate"
brew "tfupdate"    # Update Terraform version constraints

# Infrastructure as Code - Ansible
brew "ansible"    # Config management

# Security & Scanning
tap "trufflesecurity/trufflehog"
brew "trufflehog"    # Find secrets in code repositories

# Network & Download Tools
brew "wget"    # Internet file retriever

# Fun & Entertainment
brew "archey4"    # System information tool with Apple logo
brew "cowsay"     # Configurable talking cow
brew "fortune"    # Random quotes
brew "sl"         # Steam locomotive (typo of ls)
